blog/2016/10/07/scala/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Scala - org-page</title>
  <meta charset="utf-8" />
  <meta name="author" content="latpaw" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">org-page</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/Blog">Blog</a></li>
          <li><a href="https://github.com/latpaw">GitHub</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>Scala</h1>
            <div id="outline-container-org20096e2" class="outline-2">
<h2 id="org20096e2">Scala</h2>
<div class="outline-text-2" id="text-org20096e2">
</div><div id="outline-container-org92a7f2d" class="outline-3">
<h3 id="org92a7f2d">Actor sender</h3>
<div class="outline-text-3" id="text-org92a7f2d">
<div class="org-src-container">
<pre class="src src-scala">package hello.latpaw.shapes

object Messages {
  object Exit
  object Finished
  case class Response(message: String)
}

import akka.actor.Actor

class Shapes extends Actor {
  import Messages._

  def recieve = {
    case s: Shape =&gt;
      println(s" println shape")
      sender ! Response(s"res for shape")
    case Exit =&gt;
      println(s"exiting")
      sender ! Finished
    case unexpected =&gt;
      val response = Response(s"unkown message")
      println(s"unexpected println")
      sender ! response
  }
}

sender.!( Response("asd") )
! 是个方法
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd220bb" class="outline-3">
<h3 id="orgbd220bb">case</h3>
<div class="outline-text-3" id="text-orgbd220bb">
<p>
case 会创建 object，class，等伴函数
</p>
</div>
</div>
<div id="outline-container-orgebf7b10" class="outline-3">
<h3 id="orgebf7b10">object 相当于单例类，和module的结合体</h3>
</div>
<div id="outline-container-orgde5fabf" class="outline-3">
<h3 id="orgde5fabf">偏函数</h3>
<div class="outline-text-3" id="text-orgde5fabf">
<p>
偏函数是指输入一个参数，返回固定的类型或者其他类型，一般来说是空值，比如 x/y，当y为0的时候不能正常返回
</p>
</div>
</div>
<div id="outline-container-orgee5ff6b" class="outline-3">
<h3 id="orgee5ff6b">range</h3>
<div class="outline-text-3" id="text-orgee5ff6b">
<div class="org-src-container">
<pre class="src src-scala">1 to 10 // include 10
1 until 10 // not include 10
1 to 10 by 3 //
1.1f to 10.1f by 3.1f
'a' to 'g' by 2
BigInt(8) to BigInt(100) by 9
</pre>
</div>
</div>
</div>
<div id="outline-container-org9473448" class="outline-3">
<h3 id="org9473448">apply</h3>
<div class="outline-text-3" id="text-org9473448">
<p>
apply()语法糖，让你调用一个对象时就像你在调用一个函数。
</p>
</div>
</div>
<div id="outline-container-org6eb0d09" class="outline-3">
<h3 id="org6eb0d09">function1 function2 .. function22</h3>
<div class="outline-text-3" id="text-org6eb0d09">
<p>
分别带1-22个参数的trait
The only distinction between Function1 and PartialFunction is that the latter can specify inputs which it will not handle.
</p>
</div>
<div id="outline-container-org7e7c560" class="outline-4">
<h4 id="org7e7c560">必须实现 apply 函数</h4>
</div>
<div id="outline-container-org5c8f200" class="outline-4">
<h4 id="org5c8f200">function1 有apply， andThen: g(f(x))，compose: f(g(x))，toString 方法</h4>
</div>
<div id="outline-container-orge215ba0" class="outline-4">
<h4 id="orge215ba0">function2-22 有apply，curried，tupled， toString方法</h4>
<div class="outline-text-4" id="text-orge215ba0">
<p>
<a href="http://blog.csdn.net/bdmh/article/details/50216589">http://blog.csdn.net/bdmh/article/details/50216589</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb7641e0" class="outline-3">
<h3 id="orgb7641e0">数据类型</h3>
<div class="outline-text-3" id="text-orgb7641e0">
</div><div id="outline-container-org4da6746" class="outline-4">
<h4 id="org4da6746">List</h4>
</div>
<div id="outline-container-org35b0006" class="outline-4">
<h4 id="org35b0006">Set</h4>
</div>
<div id="outline-container-org87fe643" class="outline-4">
<h4 id="org87fe643">Tuple  t._1 t._2</h4>
<div class="outline-text-4" id="text-org87fe643">
<p>
1 -&gt; 2 创建一个元组
</p>
</div>
</div>
<div id="outline-container-orgf1a1534" class="outline-4">
<h4 id="orgf1a1534">Map</h4>
<div class="outline-text-4" id="text-orgf1a1534">
<p>
Map(1-&gt;"one", 2-&gt;"two")
val bb = Map("hello"-&gt;Map("a"-&gt;"b"))
bb.get("hello").getOrElse
</p>
</div>
</div>
<div id="outline-container-orgdeb5297" class="outline-4">
<h4 id="orgdeb5297">Option</h4>
<div class="outline-text-4" id="text-orgdeb5297">
<p>
是一个trait
</p>
</div>
</div>
<div id="outline-container-org0c114c0" class="outline-4">
<h4 id="org0c114c0">函数组合子 functional combinator</h4>
<div class="outline-text-4" id="text-org0c114c0">
<p>
map foreach filter zip partition find drop dropWhile
foldLeft foldRight flatten flatMap
</p>
</div>
</div>
</div>
</div>

    </div>
</section>


<footer id="footer">
    <br />
</footer>

  </body>
</html>
